000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. PROG01.
000030 AUTHOR. WILKSON SILVA.
000040 DATE-WRITTEN. 16/01/2020.
000050*      ******** PROGRAMA CADASTRO CLIENTE *********             *
000060
000070 ENVIRONMENT DIVISION.
000080 SPECIAL-NAMES.
000090     DECIMAL-POINT IS COMMA.
000100
000110 FILE-CONTROL.
000120     SELECT ARQ-CLIENTE ASSIGN TO DISK WID-ARQ-CLIENTE
000130            ORGANIZATION     IS INDEXED
000140            RECORD KEY       IS CLI-CODIGO
000150            ACCESS MODE      IS DYNAMIC
000160            LOCK MODE        IS MANUAL
000170            FILE STATUS      IS WS-RESULTADO-ACESSO.
000180
000190 DATA DIVISION.
000200 FILE SECTION.
000210 COPY "ARQ-CLIENTE.FD".
000220
000230 WORKING-STORAGE SECTION.
000260
000270 01 AUX-REGISTRO-CLIENTE.
000280    02 AUX-CODIGO            PIC 9(07).
000290    02 AUX-CNPJ              PIC 9(14).
000300    02 AUX-RAZAO-SOCIAL      PIC X(40).
000310    02 AUX-LATITUDE          PIC s9(03)V9(08).
000320    02 AUX-LONGITUDE         PIC s9(03)V9(08).
000330
000340 77 LINHA-TRACO           PIC X(80) VALUE ALL '-'.
000350 77 LIMPA-LINHA           PIC X(80) VALUE SPACES.
000360 77 WID-ARQ-CLIENTE       PIC X(50) VALUE SPACES.
000370 77 WS-RESULTADO-ACESSO   PIC 9(02) VALUES ZEROS.
000380 77 TIPO-LEITURA          PIC X(02) VALUES SPACES.
000390 77 CONTROLE-FIM          PIC 9(02) VALUES ZEROS.
000400 77 OPCAO                 PIC A(01) VALUES SPACES.
000410 77 PAUSA                 PIC X(02) VALUES SPACES.
000420 77 LK-TIPO-DADO          PIC 9(01). *> 01 - CLIENTE 02 - VENDEDOR
000430 77 WS-RESPOSTA           PIC X(01) VALUE SPACES.
000440 77 MASCARA-DATA-CADASTRO PIC 99/99/99.
       77 WS-RETORNO            PIC X(01).
000450
000460 LINKAGE SECTION.
000470 77 DATA-DE-HOJE          PIC 99/99/99.
000480
000490 SCREEN SECTION.
000500 01 LIMPA-TELA   BLANK SCREEN
000510                 BACKGROUND-COLOR 1
000520                 FOREGROUND-COLOR 7.
000530
000540 01 TELA-CLIENTE BLANK SCREEN
000550                 BACKGROUND-COLOR 1
000560                 FOREGROUND-COLOR 7.
000570    02 LINE 01 COLUMN 01 PIC X(80) FROM LINHA-TRACO.
000580    02 LINE 02 COLUMN 01 PIC X(08) FROM DATA-DE-HOJE.
000590    02 LINE 02 COLUMN 25 VALUE
000600       "     Cadastro de Clientes     ".
000610    02 LINE 02 COLUMN 73 VALUE "PROG01".
000620    02 LINE 03 COLUMN 01 PIC X(80) FROM LINHA-TRACO.
000630    02 LINE 04 COLUMN 01 VALUE "CODIGO DO CLIENTE.....".
000640    02 LINE 05 COLUMN 01 VALUE "CNPJ .................".
000650    02 LINE 06 COLUMN 01 VALUE "RAZAO SOCIAL..........".
000660    02 LINE 07 COLUMN 01 VALUE "LATITUDE..............".
000670    02 LINE 08 COLUMN 01 VALUE "LONGITUDE.............".
000680    02 LINE 09 COLUMN 01 PIC X(80) FROM LINHA-TRACO.
000690
000700 PROCEDURE DIVISION USING DATA-DE-HOJE.
000710
000720 INICIO.
000730
000740*----------VERIFICA SE O USUARIO QUER IMPORTAR O ARQUIVO----------*
000750     DISPLAY "DESEJA IMPORTAR UM ARQUIVO? S/N " AT 2401
000760     PERFORM UNTIL WS-RESPOSTA = "S" OR = "N" or = "n" or = "s"
000770        ACCEPT WS-RESPOSTA AT 2433
000780     END-PERFORM
000790     IF WS-RESPOSTA = "S"  OR = "s"
000800        PERFORM TRATA-IMPORTA
000810           THRU F-TRATA-IMPORTA
000820        EXIT PROGRAM
000830     END-IF
000840*------ VERIFICAÇÃO PARA INCLUSAO OU ALTERAÇAO NO CADASTRO -------*
000850     MOVE "CLIENTE.DAT"   TO WID-ARQ-CLIENTE
000860     OPEN I-O ARQ-CLIENTE
000870     IF WS-RESULTADO-ACESSO NOT = 00
000880        OPEN OUTPUT ARQ-CLIENTE
000890        CLOSE ARQ-CLIENTE
000900        OPEN I-O ARQ-CLIENTE
000910     END-IF
000920*------ VERIFICAÇÃO DO PROXIMO CODIGO CLIENTE A SER LANÇADO ------*
000930     MOVE 9999999 TO CLI-CODIGO
000940     PERFORM UNTIL CLI-CODIGO = ZEROS
000950        MOVE 9999999 TO CLI-CODIGO
000960        START ARQ-CLIENTE KEY LESS CLI-CODIGO
000970        IF WS-RESULTADO-ACESSO NOT = 00
000980           DISPLAY "ERRO NO POSICIONAMENTO DA CHAVE - CLIENTE: "
000990                AT 2401
001000           DISPLAY WS-RESULTADO-ACESSO AT 2440
001010           ACCEPT  PAUSA               AT 2478
001020           DISPLAY LIMPA-TELA          AT 2401
001030        END-IF
001040        READ ARQ-CLIENTE NEXT AT END
001050          MOVE ZEROS TO CLI-CODIGO
001060        END-READ
001070        ADD 1 TO CLI-CODIGO
001080        MOVE CLI-CODIGO TO AUX-CODIGO
001090*------ INICIO DO PROCESSO ---------------------------------------*
001100        MOVE 1 TO CLI-CODIGO
001110        PERFORM MOSTRAR-TELA
001120        ACCEPT AUX-CODIGO AT 0424
001130        MOVE AUX-CODIGO TO CLI-CODIGO
001140        IF CLI-CODIGO NOT EQUAL ZEROS THEN
001150           MOVE "I" TO TIPO-LEITURA
001160           PERFORM LER-ARQUIVO THRU FIM-LER-ARQUIVO
001170              IF WS-RESULTADO-ACESSO = 23
001180                 PERFORM INCLUIR
001190
                    ELSE
001200                 PERFORM CONSULTAR
001210                 PERFORM EXECUTAR-OPCAO
001220              END-IF
001230        END-IF
001240     END-PERFORM
001250     .
001260 FIM.
001270     CLOSE ARQ-CLIENTE
001280     IF WS-RESULTADO-ACESSO NOT = 0
001290        DISPLAY "ERRO NO FECHAMENTO;" AT 2401
001300        DISPLAY WS-RESULTADO-ACESSO        AT 2421
001310     END-IF
001320     EXIT PROGRAM
001330     .
001340 MOSTRAR-TELA.
001350     DISPLAY TELA-CLIENTE AT 0101
001360     .
001370 LER-ARQUIVO.
001380     MOVE 99 TO WS-RESULTADO-ACESSO
001390     PERFORM UNTIL WS-RESULTADO-ACESSO NOT = 99
001400        IF TIPO-LEITURA = "I"
001410           READ ARQ-CLIENTE
001420           IF WS-RESULTADO-ACESSO NOT = 00
001430              MOVE 1 TO CONTROLE-FIM
001440           END-IF
001450        ELSE
001460           READ ARQ-CLIENTE NEXT AT END
001470                MOVE 1 TO CONTROLE-FIM
001480           END-READ
001490        END-IF
001500        IF WS-RESULTADO-ACESSO = 68
001510           DISPLAY
001520           "REGISTRO BLOQUEADO POR OUTRO USUARIO. AGUARDE..."
001530           AT 2401
001540           ACCEPT PAUSA AT 2478
001550        END-IF
001560     END-PERFORM
001570     IF WS-RESULTADO-ACESSO NOT = 00 AND 02 AND 23 AND 10
001580        DISPLAY "ERRO NA LEITURA - CLIENTES:" AT 2401
001590        DISPLAY WS-RESULTADO-ACESSO         AT 2440
001600        ACCEPT PAUSA                        AT 2478
001610        DISPLAY LIMPA-TELA
001620     END-IF
001630     .
001640 FIM-LER-ARQUIVO.
001650     EXIT
001660     .
001670 INCLUIR.
001680     INITIALIZE AUX-REGISTRO-CLIENTE
001690     IF CLI-CODIGO NOT EQUAL ZEROS
001800        PERFORM UNTIL WS-RETORNO = "N"
001710              ACCEPT AUX-CNPJ AT 0524
001720              MOVE AUX-CNPJ TO CLI-CNPJ
001730              IF AUX-CNPJ = ZEROS
001740                 DISPLAY "O CNPJ E OBRIGATORIO!" AT 2401
                    ELSE
                       MOVE "S" TO WS-RETORNO
                       CALL "VALIDA-CNPJ" USING CLI-CNPJ
                                            WS-RETORNO
                       PERFORM CNPJ-DUPLICADO THRU F-CNPJ-DUPLICADO
                       IF WS-RETORNO = "S"
001740                    DISPLAY
                          "CNPJ INVALIDO! DIGITE NOVAMENTE." AT 2401
                       END-IF
001840                 MOVE AUX-CNPJ TO CLI-CNPJ
001750              END-IF
001850        END-PERFORM
001870        DISPLAY LIMPA-LINHA               AT 2401
001880        ACCEPT AUX-RAZAO-SOCIAL           AT 0624
001890        MOVE AUX-RAZAO-SOCIAL TO CLI-RAZAO-SOCIAL
001900        ACCEPT AUX-LATITUDE               AT 0724
001910        MOVE AUX-LATITUDE     TO CLI-LATITUDE
001920        ACCEPT AUX-LONGITUDE              AT 0824
001930        MOVE AUX-LONGITUDE    TO CLI-LONGITUDE
001940        PERFORM GRAVAR
001950     ELSE
001960        DISPLAY LIMPA-TELA
001970        DISPLAY "FIM DE CADASTRO" AT 1010
001980        ACCEPT PAUSA              AT 2478
001990     END-IF
002000     DISPLAY LIMPA-TELA
002010     .
002020 GRAVAR.
002030     WRITE REGISTRO-CLIENTE
002040     IF WS-RESULTADO-ACESSO NOT = 00
002050        DISPLAY "ERRO NO FECHAMENTO:" AT 2401
002060        DISPLAY WS-RESULTADO-ACESSO   AT 2440
002070        ACCEPT PAUSA                  AT 2478
002080     END-IF
002090     DISPLAY LIMPA-TELA               AT 2401
002100     .
002110 CONSULTAR.
002120     PERFORM MOSTRAR-TELA
002130     MOVE CLI-CODIGO TO AUX-CODIGO
002140     DISPLAY AUX-CODIGO                     AT 0424
002150     MOVE CLI-CNPJ TO AUX-CNPJ
002160     DISPLAY AUX-CNPJ                       AT 0524
002170     MOVE CLI-RAZAO-SOCIAL TO AUX-RAZAO-SOCIAL
002180     DISPLAY AUX-RAZAO-SOCIAL               AT 0624
002190     MOVE CLI-LATITUDE TO AUX-LATITUDE
002200     DISPLAY AUX-LATITUDE                   AT 0724
002210     MOVE CLI-LONGITUDE TO AUX-LONGITUDE
002220     DISPLAY AUX-LONGITUDE                  AT 0824
002230     DISPLAY
002240     "INFORME: (A)LTERAR (E)XCLUIR (P)ROXIMO ENTER(CONTINUAR)"
002250                                             AT 2401
002260     INITIALIZE OPCAO
002270     ACCEPT OPCAO AT 2478
002280     .
002290 EXECUTAR-OPCAO.
002300     EVALUATE OPCAO
002310         WHEN "A"
002320             PERFORM ALTERAR
002330         WHEN "E"
002340             PERFORM EXCLUIR
002350         WHEN "P"
002360             PERFORM LER-PROXIMO
002390     END-EVALUATE
002400     .
002410 LER-PROXIMO.
002420     INITIALIZE CONTROLE-FIM
002430     PERFORM UNTIL CONTROLE-FIM = 1
002440         MOVE "S" TO TIPO-LEITURA
002450         PERFORM LER-ARQUIVO
002460         IF CONTROLE-FIM NOT = 1
002470             PERFORM CONSULTAR
002480             IF OPCAO NOT = "P"
002490                 MOVE 1 TO CONTROLE-FIM
002500             END-IF
002510         END-IF
002520     END-PERFORM
002530     .
002540 ALTERAR.
002550     PERFORM MOSTRAR-TELA
002560     ACCEPT AUX-CODIGO                           AT 0424
002570     MOVE AUX-CODIGO TO CLI-CODIGO
001800     PERFORM UNTIL WS-RETORNO = "N"
001710        ACCEPT AUX-CNPJ AT 0524
001720        MOVE AUX-CNPJ TO CLI-CNPJ
001730        IF AUX-CNPJ = ZEROS
001740           DISPLAY "O CNPJ E OBRIGATORIO!" AT 2401
              ELSE
                 MOVE "S" TO WS-RETORNO
                 CALL "VALIDA-CNPJ" USING CLI-CNPJ
                                          WS-RETORNO
                 PERFORM CNPJ-DUPLICADO THRU F-CNPJ-DUPLICADO
                 IF WS-RETORNO = "S"
001740              DISPLAY
                    "CNPJ INVALIDO! DIGITE NOVAMENTE." AT 2401
                 END-IF
001840           MOVE AUX-CNPJ TO CLI-CNPJ
001750        END-IF
001850     END-PERFORM
002660     MOVE AUX-CNPJ TO CLI-CNPJ
002670     ACCEPT AUX-RAZAO-SOCIAL                     AT 0624
002680     MOVE AUX-RAZAO-SOCIAL TO CLI-RAZAO-SOCIAL
002690     ACCEPT AUX-LATITUDE                         AT 0724
002700     MOVE AUX-LATITUDE TO CLI-LATITUDE
002710     ACCEPT AUX-LONGITUDE                        AT 0824
002720     MOVE AUX-LONGITUDE TO CLI-LONGITUDE
002730     REWRITE REGISTRO-CLIENTE
002740     IF WS-RESULTADO-ACESSO NOT = 00 AND 02 THEN
002750        DISPLAY "ERRO NA ATUALIZACAO - CLIENTES:" AT 2401
002760        DISPLAY WS-RESULTADO-ACESSO               AT 2440
002770        ACCEPT PAUSA                              AT 2478
002780        DISPLAY LIMPA-TELA                        AT 2401
002790     END-IF
002800     .
002810 EXCLUIR.
002820     DELETE ARQ-CLIENTE
002830     IF WS-RESULTADO-ACESSO NOT = 00
002840        DISPLAY "ERRO NA EXCLUSAO - CLIENTES:" AT 2401
002850        DISPLAY WS-RESULTADO-ACESSO            AT 2440
002860        ACCEPT PAUSA                           AT 2478
002870        DISPLAY LIMPA-TELA                     AT 2401
002880     END-IF
002890     .
002900 TRATA-IMPORTA.
002910     MOVE 1 TO  LK-TIPO-DADO
002920     DISPLAY LIMPA-TELA
002930     CALL "IMPORTACAO" USING DATA-DE-HOJE
002940                             LK-TIPO-DADO
002950     CANCEL "IMPORTACAO".
002980 F-TRATA-IMPORTA. EXIT.

       CNPJ-DUPLICADO.
           MOVE CLI-CODIGO TO AUX-CODIGO
           MOVE ZEROS TO CLI-CODIGO
           START ARQ-CLIENTE KEY NOT LESS CLI-CODIGO
           IF WS-RESULTADO-ACESSO = 00
              PERFORM UNTIL EXIT
              MOVE ZEROS TO CLI-CNPJ
              READ ARQ-CLIENTE NEXT
              AT END
                 EXIT PERFORM
              END-READ
              IF AUX-CNPJ = CLI-CNPJ  AND CLI-CODIGO <> AUX-CODIGO
                 MOVE "S" TO WS-RETORNO
                 DISPLAY "CNPJ DUPLICADO  " AT 2401
                 ACCEPT PAUSA               AT 2478
                 EXIT PERFORM
              END-IF
              END-PERFORM
           END-IF.
           MOVE AUX-CNPJ TO CLI-CNPJ.
           MOVE AUX-CODIGO TO CLI-CODIGO.
           START ARQ-CLIENTE KEY EQUAL CLI-CODIGO.
       F-CNPJ-DUPLICADO. EXIT.


