000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. PROG00.
000030 AUTHOR. WILKSON SILVA.
000040 DATE-WRITTEN. 15/01/2020
000050*              ******** MENU PRINCIPAL ********
000060
000070 ENVIRONMENT DIVISION.
000080 SPECIAL-NAMES.
000090     DECIMAL-POINT IS COMMA.
000100
000110 DATA DIVISION.
000120 WORKING-STORAGE SECTION.
000130 01 DATA-SISTEMA         PIC 9(06) VALUE ZEROS.
000140 01 FILLER REDEFINES DATA-SISTEMA.
000150    02 ANO-SISTEMA       PIC 9(02).
000160    02 MES-SISTEMA       PIC 9(02).
000170    02 DIA-SISTEMA       PIC 9(02).
000180 77 LINHA-TRACO          PIC X(80) VALUE ALL '-'.
000190 01 CAB-DATA             PIC 99/99/99.
000200 01 OPCAO                PIC 9(2) VALUE 1.
000210
000220 SCREEN SECTION.
000230 01 LIMPA-TELA   BLANK SCREEN
000240                 BACKGROUND-COLOR 1
000250                 FOREGROUND-COLOR 7.
000260
000270 01  MENU BLANK SCREEN
000280          BACKGROUND-COLOR 1
000290          FOREGROUND-COLOR 7.
000300     02 LINE 01 COLUMN 01 PIC X(80) FROM LINHA-TRACO.
000310     02 LINE 02 COLUMN 01 PIC X(08) FROM CAB-DATA.
000320     02 LINE 02 COLUMN 15 VALUE
000330        "AMBEV - Sistema Gerenciador de Carteiras de Clientes".
000350     02 LINE 03 COLUMN 01 PIC X(80) FROM LINHA-TRACO.
000340     02 LINE 04 COLUMN 01 VALUE "CADASTROS".
000360     02 LINE 06 COLUMN 05 VALUE
000370        "01 - CADASTRO DE CLIENTES".
000380     02 LINE 07 COLUMN 05 VALUE
000390        "02 - CADASTRO DE VENDEDORES".
000391     02 LINE 08 COLUMN 01 VALUE "RELATORIOS".
000400     02 LINE 10 COLUMN 05 VALUE
000410        "03 - RELATORIO DE CLIENTES".
000420     02 LINE 11 COLUMN 05 VALUE
000430        "04 - RELATORIO DE VENDEDORES".
000391     02 LINE 12 COLUMN 01 VALUE "EXECUTAR".
000440     02 LINE 14 COLUMN 01 VALUE
000450        "05 - EXECUTAR DISTRIBUICAO DE CLIENTES".
000460     02 LINE 24 COLUMN 01
000470        "Informe sua opcao. Para encerrar digite 00: ".
000480
000490 PROCEDURE DIVISION.
000500 INICIO.
000510     ACCEPT DATA-SISTEMA FROM DATE
000520     MOVE DIA-SISTEMA TO CAB-DATA (1:2)
000530     MOVE "/" TO CAB-DATA (3:1)
000540     MOVE MES-SISTEMA TO CAB-DATA (4:2)
000550     MOVE "/" TO CAB-DATA (6:1)
000560     MOVE ANO-SISTEMA TO CAB-DATA (7:2)
000570     PERFORM UNTIL OPCAO EQUAL 00
000580         DISPLAY MENU
000590         ACCEPT OPCAO
000600         EVALUATE OPCAO
000610             WHEN 01  *> CADASTRAR CLIENTES
000620                 DISPLAY LIMPA-TELA
000630                 CALL "PROG01" USING CAB-DATA
000640                 CANCEL "PROG01"
000650             WHEN 02  *> CADASTRAR VENDEDORES
000660                 DISPLAY LIMPA-TELA
000670                 CALL "PROG02" USING CAB-DATA
000680                 CANCEL "PROG02"
000690             WHEN 03  *> LISTAR CLIENTES
000700                 DISPLAY LIMPA-TELA
000710                 CALL "PROG03" USING CAB-DATA
000720                 CANCEL "PROG03"
000730             WHEN 04  *> LISTAR VENDEDORES
000740                 DISPLAY LIMPA-TELA
000750                 CALL "PROG04" USING CAB-DATA
000760                 CANCEL "PROG04"
000770             WHEN 05  *> DISTRIBUICAO
000780                 DISPLAY LIMPA-TELA
000790                 CALL "PROG05" USING CAB-DATA
000800                 CANCEL "PROG05"
001010             END-EVALUATE
001020     END-PERFORM.
001040 FIM.
001050     STOP RUN.
